Revit 2027 API
TabbedDialogExtension.OnRestoreDefaultsAction Property
The restore defaults handler.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TabbedDialogAction OnRestoreDefaultsAction { get; set; }
Public Property OnRestoreDefaultsAction As TabbedDialogAction
	Get
	Set
public:
property TabbedDialogAction^ OnRestoreDefaultsAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
member OnRestoreDefaultsAction : TabbedDialogAction with get, set
Property Value
TabbedDialogAction
Remarks
This handler will be invoked when the "Restore Defaults" button in Revit options dialog is clicked and the handler should apply only to options set on this page. There is no "Restore Defaults" button in Revit options dialog if this property was set to null.
See Also
Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace